#include <iostream>
#include <locale.h>
#include <cmath>

using namespace std;

//if 23 geo 15 Дано координати точки, що не лежить на координатних осях OX та OY.
// Визначити номер координатної чверті, в якій знаходиться дана точка.

void if23();
void geo15();
void geo15s();


int main() {
	setlocale(LC_ALL, "Ukrainian");
	int choice = 0; //Декларування змінної задля choice
	cout << "Виберiть яку з цих задач будете вирiшувати: " << endl << 
		"1. If 23" << endl << 
		"2. Geo 15" << endl << 
		"3. Geo 15(Площа та периметр)" << endl;

	cin >> choice;

	switch (choice)
	{
		case 1:
		{
			// if 23
			if23();
			break;
		}
		case 2:
		{
			// geo15.1(Належність точки до фігури)
			geo15();
			break;
		}
		case 3:
		{
			//geo15.2(Периметр та площа)
			geo15s();
			break;
		}
		default:
		{
			cout << "Такого варiанту немає\n";
			break;
		}
	}
}

void if23()
{
	int x, y, x1, x2, y1, y2,x3 = 0,y3= 0;  //Декларувація змінних 

	cout << "Уведіть x y: ";
	cin >> x >> y; // Введення даних у змінну
	cout << "Уведіть x1 y1: ";
	cin >> x1 >> y1; // Введення даних у змінну
	cout << "Уведіть x2 y2: ";
	cin >> x2 >> y2; // Введення даних у змінну
	 
	x3 = x + x2 - x1; // Розрахування 
	y3 = y + y2 - y1; // Розрахування 


	if(x3 < 0 && y3 < 0)
	{
		cout << "Точка (" << x3 << ";" << y3 << ") знаходиться у " << "III чверті"; // Виведення результату
	}
	else if (x3 > 0 && y3 < 0)
	{
		cout << "Точка (" << x3 << ";" << y3 << ") знаходиться у " << "IV чверті"; // Виведення результату
	}
	else if (x3 < 0 && y3 > 0)
	{
		cout << "Точка (" << x3 << ";" << y3 << ") знаходиться у " << "II чверті"; // Виведення результату
	}
	else if (x3 > 0 && y3 > 0)
	{
		cout << "Точка (" << x3 << ";" << y3 << ") знаходиться у " << "I чверті"; // Виведення результату
	}
	else if (x3 == 0 || y3 == 0) {
		cout << "Точка (" << x3 << ";" << y3 << ") лежить на нульовій координаті"; // Виведення результату
	} 
}

void geo15() {
	int r = 0, x = 0, y = 0; //Декларування змінних
	bool ar1, ar2; //Декларування змінних типу bool

	cout << "Введіть радіус: "; 
	cin >> r;

	cout << "Уведіть x та y: ";
	cin >> x >> y;

	ar1 = pow((x - r), 2) + pow((y - r), 2) > pow(r, 2) && y > -x + 2 * r && x < r && y < 2 * r;		// Розрахунок знаходження першої фігури
	ar2 = pow((x - r), 2) + pow((y - r), 2) < pow(r, 2) && y > 1 && x > 1;			 // Розрахунок знаходження другої фігури
	
	if (ar1 || ar2) {
		cout << "In region!" << endl;
	}
	else {
		cout << "Out of region!";
	}
}

void geo15s() {
	int r, x, y;
	const float pi = 3.14;
	cout << "Введіть радіус: ";
	cin >> r;

	float square1 = (pi * pow(r, 2)) / 4;
	float square2 = (pow(2 * r, 2)) - (pi * pow(r, 2));

	cout << "Площа першої ділянки = " << square1 << endl; // Виведення результату
	cout << "Площа другої ділянки = " << square2 << endl; // Виведення результату
}
